NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A620F1536IM40.svd
        <register>
          <name>DIRECTMODE</name>
          <description>No Description</description>
          <addressOffset>0x164</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000010C</resetValue>
          <resetMask>0x00001F0F</resetMask>
          <fields>
            <field>
              <name>DMENABLE</name>
              <description>Enable Direct Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCASYNC</name>
              <description>Choose Synchronous or Asynchronous mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCPREAM</name>
              <description>Synchronous mode preamble</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD0</name>
                  <description>No preamble bits appended</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD8</name>
                  <description>8 preamble bits appended</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD16</name>
                  <description>16 preamble bits appended</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD32</name>
                  <description>32 preamble bits appended</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKWIDTH</name>
              <description>Synchronous mode clock pulse width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE</name>
          <description>No Description</description>
          <addressOffset>0x168</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FA53E8</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCORRTHD</name>
              <description>Correlator threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCORRSCHWIN</name>
              <description>Window size</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRBLE</name>
              <description>Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRTIMCORRTHD</name>
              <description>Correlator threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRBLEDSA</name>
              <description>DSA enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRDEC</name>
              <description>DEC value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE1</name>
          <description>No Description</description>
          <addressOffset>0x16C</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>
          <fields>
            <field>
              <name>LRSS</name>
              <description>Long Range Signal Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRTIMEOUTTHD</name>
              <description>Long Range Time Out Threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPWRACCUDEL</name>
              <description>Channel Power Accumulated Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEL0</name>
                  <description>Use accumulated channel power value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL32</name>
                  <description>Delayed by 32 chips</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL64</name>
                  <description>Delayed by 64 chips</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSVAL</name>
              <description>Hysteresis Value for BBSS</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVGWIN</name>
              <description>Average window</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRSPIKETHADD</name>
              <description>Long Range DSA spike threshold addition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDPUGATE</name>
              <description>Logic Based Phase Unwrap Gating</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDLRDEMODGATE</name>
              <description>Logic Based Long Range Demod Gating</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFILTLEN</name>
              <description>Prefilter Length</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEN32</name>
                  <description>Filter length is 32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN64</name>
                  <description>Filter length is 64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN96</name>
                  <description>Filter length is 96</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEN128</name>
                  <description>Filter length is 128</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE2</name>
          <description>No Description</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH1</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH2</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH3</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH4</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE3</name>
          <description>No Description</description>
          <addressOffset>0x174</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH5</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH6</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH7</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH8</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE4</name>
          <description>No Description</description>
          <addressOffset>0x178</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH9</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH10</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH1</name>
              <description>Long Range channel power shift</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH2</name>
              <description>Long Range channel power shift</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH3</name>
              <description>Long Range channel power shift</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH4</name>
              <description>Long Range channel power shift</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE5</name>
          <description>No Description</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRSH5</name>
              <description>Long Range channel power shift</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH6</name>
              <description>Long Range channel power shift</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH7</name>
              <description>Long Range channel power shift</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH8</name>
              <description>Long Range channel power shift</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH9</name>
              <description>Long Range channel power shift</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH10</name>
              <description>Long Range channel power shift</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH11</name>
              <description>Long Range channel power shift</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE6</name>
          <description>No Description</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF7FFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRSPIKETH</name>
              <description>Long Range channel power spike threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRSPIKETHD</name>
              <description>Long Range spike threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH11</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH12</name>
              <description>Long Range channel power shift</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LRFRC</name>
          <description>No Description</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000101</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CI500</name>
              <description>Long Range CI mapping for 500kbps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCACKTIMETHD</name>
              <description>FRC acknowledge timeout threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCORRMODE</name>
              <description>LR Correlator operation Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COH0</name>
          <description>No Description</description>
          <addressOffset>0x188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COHDYNAMICBBSSEN</name>
              <description>Dynamic BBSS enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDYNAMICSYNCTHRESH</name>
              <description>Dynamic syncword threshold enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDYNAMICPRETHRESH</name>
              <description>Dynamic preamble threshold enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHCHPWRLOCK</name>
              <description>Channel power lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMDET</name>
                  <description>Channel power locked when timing is detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSADET</name>
                  <description>Channel power locked when DSA is detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COHCHPWRRESTART</name>
              <description>Channel power restart</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHDYNAMICPRETHRESHSEL</name>
              <description>Dynamic preamble threshold selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>1x sync coeff</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL1</name>
                  <description>0.94x sync coeff</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>0.88x sync coeff</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL3</name>
                  <description>0.74x sync coeff</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>0.5x sync coeff</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COHCHPWRTH0</name>
              <description>Channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHCHPWRTH1</name>
              <description>Channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COHCHPWRTH2</name>
              <description>Channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COH1</name>
          <description>No Description</description>
          <addressOffset>0x18C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNCTHRESH0</name>
              <description>Minimum correlation threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESH1</name>
              <description>Minimum correlation threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESH2</name>
              <description>Minimum correlation threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTHRESH3</name>
              <description>Minimum correlation threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
